import numpy as np

# резкость 3х3
sharpen_3x3 = np.array([[0, -1, 0],
                        [-1, 5, -1],
                        [0, -1, 0]])

# усредненное размытие 3х3
blur_3x3 = np.full((3, 3), 1) / 9

# размытие по Гауссу 3x3
gaussian_blur_3x3 = np.array([[1, 2, 1],
                              [2, 4, 2],
                              [1, 2, 1]]) / 16

# выделение границ 3х3
highlighting_borders_3x3 = np.array([[1, 0, -1],
                                     [1, 0, -1],
                                     [1, 0, -1]])

# тиснение 3х3
embossing_3x3 = np.array([[-2, -1, 0],
                          [-1,  1, 1],
                          [ 0,  1, 2]])

# размытие по Гауссу 5x5
gaussian_blur_5x5 = np.array([[1,  4,  6,  4, 1],
                              [4, 16, 24, 16, 4],
                              [6, 24, 36, 24, 6],
                              [4, 16, 24, 16, 4],
                              [1,  4,  6,  4, 1]]) / 256

# усредненное размытие 5x5
blur_5x5 = np.full((5, 5), 1) / 25
